{
  "pageTitle": "Welcome to my website, Juan Manuel!",
  "headerTitle": "My Professional Profile",
  "navAcerca": "About me",
  "navConocimientos": "Knowledge Acquired",
  "navEstudios": "Studies",
  "navTecnologias": "Technologies and Skills",
  "navCertificaciones": "Certifications",
  "navContactame": "Contact me",
  "aboutMeTitle": "About Me",
  "aboutMeDescription": "Hello everyone, my name is Juan Manuel Millán, I am a graduate in Web and Multiplatform Application Development. I currently reside in Dublin, where I have been living for approximately 2 years, and I have experience in the technology sector, having worked for Deloitte Spain and Accenture Ireland on large-scale projects. <br> <br> My education in Web Application Development provided me with a solid technical foundation, which I have continued to develop through my professional experience. I have worked on creating business solutions using SAP Fiori and ABAP, along with technologies such as JavaScript, HTML, JSON, jQuery, CSS, among others. My work has focused on improving various projects through the implementation of intuitive and functional applications. <br><br> I am passionate about technology in general and I am constantly updating my skills in new languages and tools to continue expanding my knowledge. I am fluent in both Spanish and English, which allows me to work in international environments and collaborate with teams from diverse cultures. <br> <br> My goal is to keep growing and learning, facing new challenges that allow me to add value to organizations.",
  "studyTitle1": "Bachelor in Science and Technology <br> <br> (NFQ Level 5)",
  "studyDescription1": "Pre-university studies specialized in the technological area with a 7.5 average grade.",
  "studyTitle2": "Graduate in Web and Multiplatform Application Development <br> <br> (NFQ Level 7)",
  "studyDescription2": "Higher National Diploma specialized training in web and multiplatform application development with a comprehensive focus on software architecture, design, and optimization.",
  "studyTitle3": "B2 English Certification",
  "studyDescription3": "Official B2 level English certification, enabling fluent communication in international environments.",
  "techTitle1": "Programming Languages",
  "techDesc11": "JavaScript (ES6+)",
  "techDesc12": "Java",
  "techDesc13": "SQL",
  "techDesc14": "Python",
  "techTitle2": "Web Development",
  "techDesc21": "HTML5 & CSS3",
  "techDesc22": "JavaScript (ES6+) & jQuery",
  "innerjs": "Modern web development with DOM manipulation, asynchrony, and API consumption. Experience with frameworks and libraries such as jQuery and SAP UI5.",
  "innerjava": "Object-oriented programming with a focus on enterprise application development. Knowledge of data structures, algorithms, and coding best practices.",
  "innersql": "Design, management, and optimization of relational databases. Creation of efficient queries, stored procedures, and data normalization.",
  "innerpython": "Application in Machine Learning, process automation, and efficient script development. Proficient in libraries such as Pandas, NumPy, and Scikit-Learn.",
  "innerhtml" : "Creation of responsive and accessible interfaces following best development practices. Proficient in Flexbox, Grid, and CSS preprocessors.",
  "innerjavas" : "Development of dynamic and interactive interfaces, optimizing user experience. Handling events, DOM manipulation, and API consumption using AJAX.",
  "innerjson" : "Data formatting and exchange in web applications and SAP systems. Experience in structuring and consuming data from REST APIs.",
  "innergit" : "Version control and collaborative work in development environments. Proficient in workflows such as Git Flow and branch management for change control.",
  "innermysql": "Design, administration, and optimization of databases for web applications. Experience in data modeling, index creation, and advanced queries.",
  "innerSql": "Development of efficient queries for data extraction, analysis, and manipulation. Implementation of stored procedures, triggers, and database normalization.",
  "innerphp": "Visual administration of MySQL databases for management and maintenance. Creation of backups, user configuration, and execution of complex queries.",
  "techDesc23": "JSON & XML",
  "techDesc24": "Git & GitHub",
  "techTitle3": "Databases",
  "techDesc31": "MySQL",
  "techDesc32": "SQL",
  "techDesc33": "PhpMyAdmin",
  "certTitle1": "SAP ABAP / FIORI",
  "certDescription1": "Deloitte internal certification in SAP ABAP / FIORI, covering development, optimization and data management in SAP environments.",
  "certTitle2": "Setting up an ABAP environment on SAP BTP",
  "certDescription2": "Configuration of the ABAP environment in SAP BTP, integration with SAP services and deployment of applications in the cloud.",
  "certTitle3": "Exploring SAP S/4HANA Sales",
  "certDescription3": "Overview of key sales processes in SAP S/4HANA Sales, including order management, billing and delivery.",
  "certTitle4": "Modern JavaScript",
  "certDescription4": "Modern JavaScript course focusing on ES6+, asynchrony, DOM manipulation and API consumption.",
  "certTitle5": "Machine learning with python",
  "certDescription5": "Machine Learning with Python course, covering machine learning models, neural networks and data processing with Scikit-Learn and TensorFlow.",
  "contactTitle": "Contact me",
  "contactDescription": "If you are a recruiter or a company interested in hiring me or learning more about me, you can fill out the form and I will contact you as soon as possible.",
  "formName": "Name:",
  "inputName" : "Your full name",
  "formEmail": "Email Address:",
  "inputEmail" : "Your contact email",
  "formSubject": "Subject:",
  "formMessage": "Message:",
  "inputSubject": "Subject of your message",
  "inputMessage": "Write your message...",
  "formSubmit": "Send Message",
  "clearForm": "Clear All",
  "contactName": "Juan Manuel Millán Gallego",
  "contactEmail": "✉️ Email: juanmamillan1996@gmail.com",
  "contactPhone": "☎️ Phone: 🇮🇪 +353 832031822 | 🇪🇸 +34 616094914",
  "contactSocial": "Social Networks:"
}
