{
  "pageTitle": "Bienvenido a mi sitio web, Juan Manuel!",
  "headerTitle": "Mi Perfil Profesional",
  "navAcerca": "Acerca de m铆",
  "navConocimientos": "Conocimientos adquiridos",
  "navEstudios": "Estudios",
  "navTecnologias": "Tecnolog铆as y Habilidades",
  "navCertificaciones": "Certificaciones",
  "navContactame": "Cont谩ctame",
  "aboutMeTitle": "Acerca de m铆",
  "aboutMeDescription": "Hola a todos, mi nombre es Juan Manuel Mill谩n, soy graduado en Desarrollo de Aplicaciones Web y Multiplataforma. Actualmente resido en Dubl铆n desde hace 3 a帽os y tengo m谩s de 2 a帽os de experiencia en el sector tecnol贸gico, habiendo trabajado para Deloitte Espa帽a y Accenture Irlanda en proyectos de gran envergadura. <br> <br> Mi formaci贸n en Desarrollo de Aplicaciones Web me proporcion贸 una s贸lida base t茅cnica, la cual he seguido desarrollando a trav茅s de mi experiencia profesional. He trabajado en la creaci贸n de soluciones empresariales utilizando SAP ABAP y FIORI, junto con tecnolog铆as como JavaScript, HTML, Python, CSS, entre otras. Mi trabajo se ha centrado en mejorar la eficiencia operativa mediante la implementaci贸n de aplicaciones intuitivas y funcionales. <br><br> Me apasiona la tecnolog铆a en general y estoy en constante actualizaci贸n de mis habilidades en nuevos lenguajes y herramientas para seguir ampliando mis conocimientos. Hablo fluidamente espa帽ol e ingl茅s, lo que me permite trabajar en entornos internacionales y colaborar con equipos de diversas culturas. <br> <br> Mi objetivo es seguir creciendo y aprendiendo, enfrentando nuevos desaf铆os que me permitan aportar valor a las organizaciones y contribuir al avance de la tecnolog铆a.",
  "studyTitle1": "Bachillerato en Ciencias y Tecnolog铆a",
  "studyDescription1": "Estudios preuniversitarios especializados en el 谩rea tecnol贸gica y con una nota media de 7,5.",
  "studyTitle2": "Graduado en Desarrollo de Aplicaciones Web y Multiplataforma",
  "studyDescription2": "Titulaci贸n superior en desarrollo de aplicaciones web y multiplataforma, con un enfoque integral en arquitectura, dise帽o y optimizaci贸n de software.",
  "studyTitle3": "Certificaci贸n B2 en Ingl茅s",
  "studyDescription3": "Certificaci贸n oficial de nivel B2 en ingl茅s, permitiendo una comunicaci贸n fluida en entornos internacionales.",
  "techTitle1": "Lenguajes de programaci贸n",
  "techDesc11": "JavaScript (ES6+)",
  "innerjs": "Desarrollo web moderno con manipulaci贸n del DOM, asincron铆a y consumo de APIs. Experiencia con frameworks y bibliotecas como jQuery y SAP UI5.",
  "innerjava": "Programaci贸n orientada a objetos con enfoque en el desarrollo de aplicaciones empresariales. Conocimientos de estructuras de datos, algoritmos y mejores pr谩cticas de codificaci贸n.",
  "innersql": "Dise帽o, gesti贸n y optimizaci贸n de bases de datos relacionales. Creaci贸n de consultas eficientes, procedimientos almacenados y normalizaci贸n de datos.",
  "innerpython": "Aplicaci贸n en Machine Learning, automatizaci贸n de procesos y desarrollo eficiente de scripts. Experto en bibliotecas como Pandas, NumPy y Scikit-Learn.",
  "innerhtml" : "Creaci贸n de interfaces responsivas y accesibles siguiendo las mejores pr谩cticas de desarrollo. Experto en Flexbox, Grid y preprocesadores de CSS.",
  "innerjavas" : "Desarrollo de interfaces din谩micas e interactivas, optimizando la experiencia del usuario. Manejo de eventos, manipulaci贸n del DOM y consumo de APIs mediante AJAX.",
  "innerjson" : "Formato e intercambio de datos en aplicaciones web y sistemas SAP. Experiencia en la estructuraci贸n y consumo de datos desde APIs REST.",
  "innergit" : "Control de versiones y trabajo colaborativo en entornos de desarrollo. Experto en flujos de trabajo como Git Flow y gesti贸n de ramas para el control de cambios.",
  "innermysql": "Dise帽o, administraci贸n y optimizaci贸n de bases de datos para aplicaciones web. Experiencia en modelado de datos, creaci贸n de 铆ndices y consultas avanzadas.",
  "innerSql": "Desarrollo de consultas eficientes para la extracci贸n, an谩lisis y manipulaci贸n de datos. Implementaci贸n de procedimientos almacenados, triggers y normalizaci贸n de bases de datos.",
  "innerphp": "Administraci贸n visual de bases de datos MySQL para gesti贸n y mantenimiento. Creaci贸n de respaldos, configuraci贸n de usuarios y ejecuci贸n de consultas complejas.",
  "techDesc12": "Java",
  "techDesc13": "SQL",
  "techDesc14": "Python",
  "techTitle2": "Desarrollo Web",
  "techDesc21": "HTML5 & CSS3",
  "techDesc22": "JavaScript (ES6+) & jQuery",
  "techDesc23": "JSON & XML",
  "techDesc24": "Git & GitHub",
  "techTitle3": "Bases de Datos",
  "techDesc31": "MySQL",
  "techDesc32": "SQL",
  "techDesc33": "PhpMyAdmin",
  "certTitle1": "SAP ABAP / FIORI",
  "certDescription1": "Certificaci贸n interna de Deloitte en SAP ABAP / FIORI, cubriendo desarrollo, optimizaci贸n y gesti贸n de datos en entornos SAP.",
  "certTitle2": "Setting up an ABAP environment on SAP BTP",
  "certDescription2": "Configuraci贸n del entorno ABAP en SAP BTP, integraci贸n con servicios de SAP y despliegue de aplicaciones en la nube.",
  "certTitle3": "Exploring SAP S/4HANA Sales",
  "certDescription3": "Descripci贸n general de los procesos clave de ventas en SAP S/4HANA Sales, incluyendo la gesti贸n de pedidos, facturaci贸n y entrega.",
  "certTitle4": "Modern JavaScript",
  "certDescription4": "Curso de JavaScript moderno con enfoque en ES6+, asincron铆a, manipulaci贸n del DOM y consumo de APIs.",
  "certTitle5": "Machine learning with python",
  "certDescription5": "Curso de Machine Learning con Python, abarcando modelos de aprendizaje autom谩tico, redes neuronales y procesamiento de datos con Scikit-Learn y TensorFlow.",
  "contactTitle": "Cont谩ctame",
  "contactDescription": "Si eres un reclutador o una empresa interesada en contratarme o saber m谩s sobre m铆, puedes llenar el formulario y me pondr茅 en contacto contigo lo antes posible.",
  "formName": "Nombre:",
  "inputName" : "Tu nombre completo",
  "formEmail": "Correo Electr贸nico:",
  "inputEmail" : "Tu email de contacto",
  "formSubject": "Motivo del contacto:",
  "inputSubject": "Asunto de tu mensaje",
  "inputMessage": "Escribe tu mensaje...",
  "formMessage": "Mensaje:",
  "formSubmit": "Enviar Mensaje",
  "clearForm": "Borrar todo",
  "contactName": "Juan Manuel Mill谩n Gallego",
  "contactEmail": "锔 Email: juanmamillan1996@gmail.com",
  "contactPhone": "锔 Tel茅fono:  +353 832031822 |  +34 616094914",
  "contactSocial": "Redes Sociales:"
}
