{
  "pageTitle": "Bienvenido a mi sitio web, Juan Manuel!",
  "headerTitle": "Mi Perfil Profesional",
  "navAcerca": "Acerca de mí",
  "navConocimientos": "Conocimientos adquiridos",
  "navEstudios": "Estudios",
  "navTecnologias": "Tecnologías y Habilidades",
  "navCertificaciones": "Certificaciones",
  "navContactame": "Contáctame",
  "aboutMeTitle": "Acerca de mí",
  "aboutMeDescription": "Hola a todos, mi nombre es Juan Manuel Millán, soy graduado en Desarrollo de Aplicaciones Web y Multiplataforma. Actualmente resido en Dublín desde hace aproximadamente 2 años y cuento con experiencia en el sector tecnológico, habiendo trabajado para Deloitte España y Accenture Irlanda en proyectos de gran envergadura. <br> <br> Mi formación en Desarrollo de Aplicaciones Web me proporcionó una buena base técnica, la cual he seguido desarrollando a través de mi experiencia profesional. He trabajado en la creación de soluciones empresariales utilizando SAP Fiori y ABAP, junto con tecnologías como JavaScript, HTML, JSON, JQuery, CSS, entre otras. Mi trabajo se ha centrado en mejorar los diferentes proyectos gracias a la implementación de aplicaciones intuitivas y funcionales. <br><br> Me apasiona la tecnología en general y estoy en constante actualización de mis habilidades en nuevos lenguajes y herramientas para seguir ampliando mis conocimientos. Hablo fluidamente español e inglés, lo que me permite trabajar en entornos internacionales y colaborar con equipos de diversas culturas. <br> <br> Mi objetivo es seguir creciendo y aprendiendo, enfrentando nuevos retor que me permitan aportar valor a las organizaciones.",
  "studyTitle1": "Bachillerato en Ciencias y Tecnología",
  "studyDescription1": "Estudios preuniversitarios especializados en el área tecnológica y con una nota media de 7,5.",
  "studyTitle2": "Graduado en Desarrollo de Aplicaciones Web y Multiplataforma",
  "studyDescription2": "Titulación superior en desarrollo de aplicaciones web y multiplataforma, con un enfoque integral en arquitectura, diseño y optimización de software.",
  "studyTitle3": "Certificación B2 en Inglés",
  "studyDescription3": "Certificación oficial de nivel B2 en inglés, permitiendo una comunicación fluida en entornos internacionales.",
  "techTitle1": "Lenguajes de programación",
  "techDesc11": "JavaScript (ES6+)",
  "innerjs": "Desarrollo web moderno con manipulación del DOM, asincronía y consumo de APIs. Experiencia con frameworks y bibliotecas como jQuery y SAP UI5.",
  "innerjava": "Programación orientada a objetos con enfoque en el desarrollo de aplicaciones empresariales. Conocimientos de estructuras de datos, algoritmos y mejores prácticas de codificación.",
  "innersql": "Diseño, gestión y optimización de bases de datos relacionales. Creación de consultas eficientes, procedimientos almacenados y normalización de datos.",
  "innerpython": "Aplicación en Machine Learning, automatización de procesos y desarrollo eficiente de scripts. Experto en bibliotecas como Pandas, NumPy y Scikit-Learn.",
  "innerhtml" : "Creación de interfaces responsivas y accesibles siguiendo las mejores prácticas de desarrollo. Experto en Flexbox, Grid y preprocesadores de CSS.",
  "innerjavas" : "Desarrollo de interfaces dinámicas e interactivas, optimizando la experiencia del usuario. Manejo de eventos, manipulación del DOM y consumo de APIs mediante AJAX.",
  "innerjson" : "Formato e intercambio de datos en aplicaciones web y sistemas SAP. Experiencia en la estructuración y consumo de datos desde APIs REST.",
  "innergit" : "Control de versiones y trabajo colaborativo en entornos de desarrollo. Experto en flujos de trabajo como Git Flow y gestión de ramas para el control de cambios.",
  "innermysql": "Diseño, administración y optimización de bases de datos para aplicaciones web. Experiencia en modelado de datos, creación de índices y consultas avanzadas.",
  "innerSql": "Desarrollo de consultas eficientes para la extracción, análisis y manipulación de datos. Implementación de procedimientos almacenados, triggers y normalización de bases de datos.",
  "innerphp": "Administración visual de bases de datos MySQL para gestión y mantenimiento. Creación de respaldos, configuración de usuarios y ejecución de consultas complejas.",
  "techDesc12": "Java",
  "techDesc13": "SQL",
  "techDesc14": "Python",
  "techTitle2": "Desarrollo Web",
  "techDesc21": "HTML5 & CSS3",
  "techDesc22": "JavaScript (ES6+) & jQuery",
  "techDesc23": "JSON & XML",
  "techDesc24": "Git & GitHub",
  "techTitle3": "Bases de Datos",
  "techDesc31": "MySQL",
  "techDesc32": "SQL",
  "techDesc33": "PhpMyAdmin",
  "certTitle1": "SAP ABAP / FIORI",
  "certDescription1": "Certificación interna de Deloitte en SAP ABAP / FIORI, cubriendo desarrollo, optimización y gestión de datos en entornos SAP.",
  "certTitle2": "Setting up an ABAP environment on SAP BTP",
  "certDescription2": "Configuración del entorno ABAP en SAP BTP, integración con servicios de SAP y despliegue de aplicaciones en la nube.",
  "certTitle3": "Exploring SAP S/4HANA Sales",
  "certDescription3": "Descripción general de los procesos clave de ventas en SAP S/4HANA Sales, incluyendo la gestión de pedidos, facturación y entrega.",
  "certTitle4": "Modern JavaScript",
  "certDescription4": "Curso de JavaScript moderno con enfoque en ES6+, asincronía, manipulación del DOM y consumo de APIs.",
  "certTitle5": "Machine learning with python",
  "certDescription5": "Curso de Machine Learning con Python, abarcando modelos de aprendizaje automático, redes neuronales y procesamiento de datos con Scikit-Learn y TensorFlow.",
  "contactTitle": "Contáctame",
  "contactDescription": "Si eres un reclutador o una empresa interesada en contratarme o saber más sobre mí, puedes llenar el formulario y me pondré en contacto contigo lo antes posible.",
  "formName": "Nombre:",
  "inputName" : "Tu nombre completo",
  "formEmail": "Correo Electrónico:",
  "inputEmail" : "Tu email de contacto",
  "formSubject": "Motivo del contacto:",
  "inputSubject": "Asunto de tu mensaje",
  "inputMessage": "Escribe tu mensaje...",
  "formMessage": "Mensaje:",
  "formSubmit": "Enviar Mensaje",
  "clearForm": "Borrar todo",
  "contactName": "Juan Manuel Millán Gallego",
  "contactEmail": "✉️ Email: juanmamillan1996@gmail.com",
  "contactSocial": "Redes Sociales:"
}
